{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0013\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "arguments": {}, "trainable": true, "name": "lambda_1", "output_shape": [66, 200, 3], "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "nb_filter": 24, "bias": true, "W_constraint": null, "activation": "relu", "name": "convolution2d_1", "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "nb_col": 5, "trainable": true, "nb_row": 5, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "nb_filter": 36, "bias": true, "W_constraint": null, "activation": "relu", "name": "convolution2d_2", "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "nb_col": 5, "trainable": true, "nb_row": 5, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "nb_filter": 48, "bias": true, "W_constraint": null, "activation": "relu", "name": "convolution2d_3", "dim_ordering": "tf", "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "nb_col": 5, "trainable": true, "nb_row": 5, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "nb_filter": 64, "bias": true, "W_constraint": null, "activation": "relu", "name": "convolution2d_4", "dim_ordering": "tf", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "nb_col": 3, "trainable": true, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "nb_filter": 64, "bias": true, "W_constraint": null, "activation": "relu", "name": "convolution2d_5", "dim_ordering": "tf", "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "nb_col": 3, "trainable": true, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "name": "dense_1", "activation": "relu", "W_regularizer": null, "output_dim": 1164, "trainable": true, "input_dim": 1152, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "name": "dense_2", "activation": "relu", "W_regularizer": null, "output_dim": 100, "trainable": true, "input_dim": 1164, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "name": "dense_3", "activation": "relu", "W_regularizer": null, "output_dim": 50, "trainable": true, "input_dim": 100, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "name": "dense_4", "activation": "relu", "W_regularizer": null, "output_dim": 10, "trainable": true, "input_dim": 50, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "name": "dense_5", "activation": "linear", "W_regularizer": null, "output_dim": 1, "trainable": true, "input_dim": 10, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}