{"config": [{"config": {"output_shape": [66, 200, 3], "trainable": true, "arguments": {}, "function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"trainable": true, "nb_filter": 24, "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "nb_row": 5, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_1", "border_mode": "valid", "activation": "relu", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "nb_filter": 36, "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "nb_row": 5, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_2", "border_mode": "valid", "activation": "relu", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "nb_filter": 48, "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null, "W_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "nb_row": 5, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_3", "border_mode": "valid", "activation": "relu", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "nb_filter": 64, "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_4", "border_mode": "valid", "activation": "relu", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "nb_filter": 64, "dim_ordering": "tf", "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_5", "border_mode": "valid", "activation": "relu", "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": 1152, "trainable": true, "bias": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_1", "activation": "relu", "output_dim": 1164}, "class_name": "Dense"}, {"config": {"input_dim": 1164, "trainable": true, "bias": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_2", "activation": "relu", "output_dim": 100}, "class_name": "Dense"}, {"config": {"input_dim": 100, "trainable": true, "bias": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_3", "activation": "relu", "output_dim": 50}, "class_name": "Dense"}, {"config": {"input_dim": 50, "trainable": true, "bias": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_4", "activation": "relu", "output_dim": 10}, "class_name": "Dense"}, {"config": {"input_dim": 10, "trainable": true, "bias": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "name": "dense_5", "activation": "linear", "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}